IDEA Connection Link
IProgressCallback Interface
 IProgressCallback
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public interface IProgressCallback
Public Interface IProgressCallback
public interface class IProgressCallback
The IProgressCallback type exposes the following members.
Methods
Name | Description
ExceptionMessage
 Method is called when an exception occurs on the server.
ProgressMessage(Double, String)
 infomation about progress of event.
ProgressMessage(Double, String, String)
 infomation about progress of event.
Top
See Also
Reference
IdeaRS.ConnectionService.Service Namespace